import 'package:places/domain/sight.dart';

final List<Sight> mocks = [
  Sight(
    name: 'Памятник «Пермяк солёные уши» в Перми',
    lat: '58.009700',
    lon: '56.239589',
    url: 'http://vtrip.ru/uploads/russia/perm/permushi2.jpg',
    details:
        'Памятник открыт 1 апреля 2006 года и построен на средства ОАО «БИНБАНК». Автор — Рустам Исмагилов. Композиция состоит из двух частей — фигуры фотографа и круглой рамки с большими ушами, которую можно использовать для фотографирования своего лица.',
    type: 'Памятник',
  ),
  Sight(
    name: 'Набережная Сочи',
    lat: '43.574782',
    lon: '39.725208',
    url: 'http://vtrip.ru/uploads/images/sochi/nabesochi.jpg',
    details:
        'Длина сочинской набережной около двух километров. Одной из особенностей сочинской набережной является то, что здесь снимали один из эпизодов фильма Бриллиантовая рука. В честь этого, неподалёку от морвокзала установлен памятник гером Бриллиантовой руки.',
    type: 'Памятник',
  ),
  Sight(
    name: 'Главный усадебный дом и церковь в селе Патакино Владимирской области',
    lat: '56.262086',
    lon: '40.908558',
    url: 'http://vtrip.ru/uploads/russia/vladimirskaya-oblast/usadbabezobrazovyh.jpg',
    details:
        'Усадьба Безобразовых - это частично сохранившийся усадебный комплекс на берегу Клязьмы в селе Патакино Владимирской области. В начале XIX века в селе Патакино развернулось грандиозное строительство, так как ковровский уездный предводитель дворянства Дмитрий Алексеевич Безобразов решил обосноваться на живописном берегу Клязьмы. Была заложен барский дом, возведена Троицкая церковь, строились хозяйственные постройки, разбит сад.',
    type: 'Памятник',
  ),
];
