import 'package:places/domain/sight.dart';

final List<Sight> mocks = [
  Sight(
    name: 'Памятник «Пермяк солёные уши» в Перми',
    lat: '58.009700',
    lon: '56.239589',
    url: 'http://vtrip.ru/uploads/russia/perm/permushi2.jpg',
    details:
        'Композиция состоит из двух частей — фигуры фотографа и круглой рамки с большими ушами, которую можно использовать для фотографирования своего лица.',
    type: 'Памятник',
  ),
  Sight(
    name: 'Набережная Сочи',
    lat: '43.574782',
    lon: '39.725208',
    url: 'http://vtrip.ru/uploads/images/sochi/nabesochi.jpg',
    details:
        'Длина сочинской набережной около двух километров. Одной из особенностей сочинской набережной является то, что здесь снимали один из эпизодов фильма Бриллиантовая рука.',
    type: 'Памятник',
  ),
  Sight(
    name: 'Главный усадебный дом и церковь в селе Патакино Владимирской области',
    lat: '56.262086',
    lon: '40.908558',
    url: 'http://vtrip.ru/uploads/russia/vladimirskaya-oblast/usadbabezobrazovyh.jpg',
    details:
        'Усадьба Безобразовых - это частично сохранившийся усадебный комплекс на берегу Клязьмы в селе Патакино Владимирской области.',
    type: 'Памятник',
  ),
];
